import streamlit as st  # streamlit 라이브러리를 불러옴

st.set_page_config(     # 페이지 설정
    page_title="NBA", # 페이지 Tab의 타이틀
    page_icon="🏀",     # 페이지 Tab의 아이콘

)

st.write("# NBA를 소개합니다.! 🏀")   # st.write()를 이용한 헤더 작성

st.sidebar.success("위의 목록에서 창을 선택하시오.")  # 사이드바에 success 메시지 출력

st.markdown(   # st.markdown()을 이용한 본문 작성
    """
    **78년의 역사를 지닌NBA**에 대하여 소개합니다.
    
    ### 1. NBA의 역사와 간략한 소개
   - NBA는 1946년 4월 6일에 설립되어 올해로 78주년을 맞이했다. 
   - 1970년대까지만 해도 대학 농구와 타 스포츠에 비해 인기가 뒤떨어졌으나 1980년대 매직 존슨과 래리 버드의 라이벌 구도를 시작으로 1990년대 마이클 조던이라는 아이콘의 등장으로 최전성기를 누렸다.
   - 이후 2000년대 상대적 암흑기를 겪다가 2010년대 스몰라인업이 주를 이루며 보다 공격적인 농구가 대세가 되고 르브론 제임스와 스테판 커리의 라이벌 구도로 제 2의 전성기를 맞이하였다.
   
   ### 2. NBA의 구성
   - NBA는 미국에 29개의 팀 캐나다에 1개의 팀으로 총 30개의 팀으로 이루어져 있는 미국 프로 농구 협회이다.
   - 동부컨퍼런스와 서부컨퍼런스 총 두 개의 컨퍼런스로 구성되어 있고 Atlantic, Central, Southeast, Southwest, Northwest, Pacific의 총 6개의 디비전으로 구성되어 있다
   - 정규 시즌만 25주간 82경기를 치른다. 같은 디비전 팀 간 4경기 + 같은 컨퍼런스 다른 디비전 팀 간 3~4경기(총 30경기) + 타 컨퍼런스 팀 간 2경기로 구성되어 있다.
     
   ### 3. NBA의 시즌 진행 방식
   - NBA는 25주간 82경기의 정규시즌을 치르고 그 순위를 토대로 플레이오프를 진행한다.
   - 각 컨퍼런스 1 ~ 6위의 팀들은 플레이오프 진출이 확정되고 7 ~ 10위의 팀들은 플레이 인 토너먼트를 진행한다
   - 플레이 인 토너먼트는 각 컨퍼런스의 7,8위 팀과 9,10위 팀이 맞붙어 7,8위 팀의 승자가 7번 시드를 7,8위 팀의 패자와 9,10위 팀의 승자가 8번 시드를 차지하는 방식이다.
   - 이후 각 컨퍼런스에서 1,8/2,7/3,6/4,5 위 팀이 각각 7판 4선제로 맞붙는다.
   - 그 후 1,8/4,5의 팀들의 맞대결 승자와 2,7/3,6의 팀들의 맞대결 승자가 서로 7판 4선제로 맞붙는다.
   - 그 후 각 승자들이 컨퍼런스 파이널을 치룬 후 각 컨퍼런스의 우승자들 끼리 NBA 우승자 타이틀을 걸고 NBA FINAL을 7판 4선제로 치뤄 우승자를 가른다.
   
   ### 4. NBA 올스타전과 시상
   - NBA의 올스타전은 시즌 중간에 치뤄지며 팬투표를 통해 각 컨퍼런스에서 5명씩 올스타전 주전을 선발한다.
   - 그 후 감독들의 투표로 14명의 벤치멤버 선수들을 각 컨퍼런스에서 7명씩 선발한 후 각 컨퍼런스에서 선두를 달리는 팀의 감독이 팀 감독을 맡는다.
   - 올스타전 시작 전에는 3점슛 콘테스트, 스킬 챌린지, 덩크 콘테스트의 이벤트 대결과 데뷔 1,2년차 선수들이 대결을 펼치는 라이징 스타즈 챌린지도 진행된다.
   - NBA는 매 시즌 종료 후 정규시즌의 성적만을 가지고 해당 시즌 최고의 선수들을 선정하는데, 스포츠 기자와 방송인으로 구성된 패널이 투표를 진행하여 ALL-NBA TEAM을 1st, 2nd, 3rd 팀 까지 선정한다.
   - 또한 매 시즌 최고의 수비수들을 선정하는 ALL-NBA DEFENSIVE TEAM과 최고의 신인들을 선정하는 ALL-NBA ROOKIE TEAM도 1st, 2nd 팀 까지 선정한다.
   - NBA의 주요 시상으로는 기량이 크게 발전한 선수에게 주는 MIP, 최고의 수비수에게 주는 올해의 수비수상, 최고의 식스맨에게 주는 올해의 식스맨상, 최고의 신인에게 주는 올해의 신인상, 최고의 감독에게 주는 올해의 코치상, 최고의 선수에게 주는 올해의 선수상 MVP가 있다.
   
"""
)